import 'package:places/domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    'Кофейня Sibaristica',
    30.283861,
    59.910208,
    'https://avatars.mds.yandex.net/get-altay/4538345/2a000001787fa76c069d4eb7050786867628/XXXL',
    'Это кофейня, которая затерялась среди кирпичных заводов. Это место, где свежеобжаренный спешелти кофе сразу наливают в чашку. Место, где все еще ощущается дух фабричного прошлого. Мы сохранили индустриальную атмосферу, добавили немного лоска и еды, которая насытит после сложного рабочего дня.',
    sightTypes.coffeeShop,
  ),
  Sight(
    'Остров Новая Голландия',
    30.287104,
    59.929610,
    'https://avatars.mds.yandex.net/get-altay/1344805/2a00000164516084f410c679146540fde647/XXXL',
    'Остров в Адмиралтейском районе Санкт-Петербурга, ограниченный рекой Мойкой, Крюковым и Адмиралтейским каналами. Кроме того, Новая Голландия - единственный в своём роде памятник промышленной архитектуры раннего классицизма. Площадь острова - 7,8 га.',
    sightTypes.park,
  ),
  Sight(
    'Bolshecoffee roasters',
    30.353768,
    59.927996,
    'https://avatars.mds.yandex.net/get-altay/4341149/2a0000017b3b0e09e6fa8c0b9125918cc40d/XXXL',
    'Хорошая кофейня с гигантским окном и берлинским интерьером. По выходным тут проходят каппинги и воркшопы.',
    sightTypes.coffeeShop,
  ),
  Sight(
    'Государственный Эрмитаж',
    30.314566,
    59.939864,
    'https://avatars.mds.yandex.net/get-altay/986332/2a000001653f7ed2792b7f067aec94f23f58/XXXL',
    'Музей изобразительного и декоративно-прикладного искусства, расположенный в городе Санкт-Петербурге Российской Федерации. Основан 7 декабря 1764 года. Является одним из крупнейших художественных музеев в мире.',
    sightTypes.museum,
  ),
];